app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @post.comments.create(comment_params)
---
INSERT INTO "comments" ("user", "body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user", "Jason"], ["body", "Says hi!"], ["post_id", 1], ["created_at", "2015-06-17 20:41:34.319113"], ["updated_at", "2015-06-17 20:41:34.319113"]]