app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.page(params[:page]).per(5)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
    @post = Post.friendly.find(params[:id])

INSERT INTO "posts" ("title", "body", "image", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "post four"], ["body", "why won't this show? Urggggghhhhh"], ["image", ""], ["user_id", 1], ["created_at", "2015-06-17 18:00:15.619555"], ["updated_at", "2015-06-17 18:00:15.619555"]]
---
  def create
    @post = current_user.posts.new(post_params)
      if @post.save

UPDATE "posts" SET "title" = $1, "body" = $2, "image" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["title", "wait. it works now?"], ["body", "wooooooo"], ["image", ""], ["updated_at", "2015-06-17 18:00:40.377415"], ["id", 3]]
---
  def update
    if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 3]]
---
    def set_post
      @post = Post.friendly.find(params[:id])